'''
Выведите таблицу размером n \times nn×n, заполненную числами от 11 до n^2n 
2
  по спирали, выходящей из левого верхнего угла и закрученной по часовой стрелке, как показано в примере (здесь n=5n=5):
Sample Input:

5
Sample Output:

1 2 3 4 5
16 17 18 19 6
15 24 25 20 7
14 23 22 21 8
13 12 11 10 9

'''

##########################################################################################################################################
n = int(input())
mat = [[0]*n for i in range(n)]
st, m = 1, 0

mat[n//2][n//2]=n*n
for v in range(n//2):

    for i in range(n-m):
        mat[v][i+v] = st
        st+=1

    for i in range(v+1, n-v):
        mat[i][-v-1] = st
        st+=1

    for i in range(v+1, n-v):
        mat[-v-1][-i-1] =st
        st+=1

    for i in range(v+1, n-(v+1)):
        mat[-i-1][v]=st
        st+=1

    m+=2

for i in mat:
    print(*i)



